# HO_GetHoistColorLbl

## Description
Get the color index of the hoist lable for truss analysis.

```pascal
FUNCTION HO_GetHoistColorLbl(
				value          : REAL;
				maxValue       : REAL;
				VAR colorIndex : INTEGER) : BOOLEAN;
```

```python

def vs.HO_GetHoistColorLbl(value, maxValue):
    return (BOOLEAN, colorIndex)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|value|REAL||
|maxValue|REAL||
|colorIndex|INTEGER||

## Version
Availability: from Vectorworks 2018
## Category
* Spotlight